In [2]:
# Player Count

* Total Number of Players

### Purchasing Analysis (Total)

* Number of Unique Items
* Average Purchase Price
* Total Number of Purchases
* Total Revenue

SyntaxError: invalid syntax (<ipython-input-2-963ae7aa6fb1>, line 3)

In [1]:
#import dependencies and set up files
import pandas as pd
pymoli_purchase_file = "Resources/purchase_data.csv"
purchase_df = pd.read_csv(pymoli_purchase_file)
purchase_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [4]:
number_of_players = len(purchase_df["SN"].unique())
print ("Total Number of Players: " + str(number_of_players))

Total Number of Players: 576

In [11]:
#Number of Unique Items
#Average Purchase Price
#Total Number of Purchases
#Total Revenue
number_of_items = len(purchase_df["Item Name"].unique())
print ("Total Number of Unique Items: " + str(number_of_items))

average_price = purchase_df["Price"].mean()
print ("Average Price of Purchas: " + str(average_price))

total_purchases = purchase_df["Purchase ID"].count()
print ("Total Number of Purchases: " + str(total_purchases))

total_revenue = purchase_df["Price"].sum()
print ("Total Revenue: " + str(total_revenue))
Purchase_Analysis = pd.DataFrame([{"Total Revenue": total_revenue, "Total Purchases": total_purchases, "Average Purchase Price": average_price, "Number of Unique Items": number_of_items}])
Purchase_Analysis

Total Number of Unique Items: 179
Average Price of Purchas: 3.050987179487176
Total Number of Purchases: 780
Total Revenue: 2379.77

,Total Revenue,Total Purchases,Average Purchase Price,Number of Unique Items
0,2379.77,780,3.050987,179

In [59]:
### Gender Demographics
# Percentage and Count of Male Players
#Percentage and Count of Female Players
#Percentage and Count of Other / Non-Disclosed
#purchase_df.groupby('SN').count()
male_df = purchase_df[purchase_df["Gender"] == "Male"]
number_of_males = len(male_df["SN"].unique())
[number_of_males, number_of_males / number_of_players * 100]

[484, 84.02777777777779]

In [60]:
female_df = purchase_df[purchase_df["Gender"] == "Female"]
number_of_females = len(female_df["SN"].unique())
[number_of_females, number_of_females / number_of_players * 100]

[81, 14.0625]

In [62]:
other_df = purchase_df[purchase_df["Gender"] == "Other / Non-Disclosed"]
number_of_other = len(other_df["SN"].unique())
[number_of_other, number_of_other / number_of_players*100]

[11, 1.9097222222222223]

In [115]:
484+81+11
652+113+15

780

In [50]:
purchase_df["Gender"].value_counts()

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [12]:
male_purchases = male_df["SN"].count()
male_average_purchase = male_df["Price"].mean()
male_total_value = male_df["Price"].sum()
male_average_spend = male_total_value / number_of_males
male_purchases

NameError: name 'male_df' is not defined

In [107]:
female_purchases = female_df["SN"].count()
female_average_purchase = female_df["Price"].mean()
female_total_value = female_df["Price"].sum()
female_average_spend = female_total_value / number_of_females

In [108]:
other_purchases = other_df["SN"].count()
other_average_purchase = other_df["Price"].mean()
other_total_value = other_df["Price"].sum()
other_average_spend = other_total_value / number_of_other

In [109]:
bins = [4.9, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 44.9, 49.9]
groupnames = ['5 to 9', '10 to 14', '15 to 19', '20 to 24', '25 to 29', '30 to 34', '35 to 39', '40 to 44', '45 to 49']
purchase_df["Demographic"] = pd.cut(purchase_df['Age'], bins, labels=groupnames, include_lowest=True)
purchase_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Demographic
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20 to 24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40 to 44
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20 to 24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20 to 24
4,4,Iskosia90,23,Male,131,Fury,1.44,20 to 24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20 to 24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20 to 24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20 to 24
778,778,Sisur91,7,Male,92,Final Critic,4.19,5 to 9
779,779,Ennrian78,24,Male,50,Dawn,4.60,20 to 24

In [110]:
demographix = purchase_df.groupby('Demographic')

In [111]:
demographic1_df = pd.DataFrame(demographix.sum())
demographic1_df.head()

             Purchase ID   Age  Item ID    Price
Demographic
5 to 9             10009   181     2428    77.13
10 to 14           10114   319     2719    82.78
15 to 19           54859  2284    12798   412.89
20 to 24          139573  7971    32335  1114.06
25 to 29           41072  2626     9128   293.00

In [153]:
demographic2_df = pd.DataFrame(demographix.count())
demographic2_df["SN"].unique()

array([ 23,  28, 136, 365, 101,  73,  41,  12,   1], dtype=int64)

In [121]:
# DemoSummary_df = demographic2_df["Age"]
# DemoSummary_df
demographic2_df

             Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
Demographic
5 to 9                23   23   23      23       23         23     23
10 to 14              28   28   28      28       28         28     28
15 to 19             136  136  136     136      136        136    136
20 to 24             365  365  365     365      365        365    365
25 to 29             101  101  101     101      101        101    101
30 to 34              73   73   73      73       73         73     73
35 to 39              41   41   41      41       41         41     41
40 to 44              12   12   12      12       12         12     12
45 to 49               1    1    1       1        1          1      1

In [122]:
demographic_bins =  pd.cut(purchase_df['Age'], bins, labels=groupnames, include_lowest=True)

In [123]:
demographic_bins

0      20 to 24
1      40 to 44
2      20 to 24
3      20 to 24
4      20 to 24
         ...
775    20 to 24
776    20 to 24
777    20 to 24
778      5 to 9
779    20 to 24
Name: Age, Length: 780, dtype: category
Categories (9, object): [5 to 9 < 10 to 14 < 15 to 19 < 20 to 24 ... 30 to 34 < 35 to 39 < 40 to 44 < 45 to 49]

In [136]:
nums = []
for x in groupnames:
    aydf = purchase_df[purchase_df["Demographic"] == x]
    number_per_demo = len(aydf["SN"].unique())

    nums.append(number_per_demo)

In [137]:
len(aydf["SN"].unique())

1

In [138]:
nums

[17, 22, 107, 258, 77, 52, 31, 11, 1]

In [140]:
sum(nums)

576

In [154]:

demographic2_df["Purchase Count"] = demographic2_df["Item ID"]
demographic2_df["Average Purchase Price"] = demographic1_df["Price"] / demographic2_df["Purchase Count"]
# demographic2_df["Person Count"] = nums
demographic2_df["Total Purchase Value"] = demographic1_df["Price"]
demographic2_df["Average Purchase Total Per Person"] = demographic1_df["Price"] / nums
demographic2_df = demographic2_df[["Purchase Count", "Average Purchase Price", "Total Purchase Value", "Average Purchase Total Per Person"]]

In [155]:
demographic2_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total Per Person
Demographic,,,,
5 to 9,23,3.353478,77.13,4.537059
10 to 14,28,2.956429,82.78,3.762727
15 to 19,136,3.035956,412.89,3.858785
20 to 24,365,3.052219,1114.06,4.318062
25 to 29,101,2.900990,293.00,3.805195
30 to 34,73,2.931507,214.00,4.115385
35 to 39,41,3.601707,147.67,4.763548
40 to 44,12,3.045000,36.54,3.321818
45 to 49,1,1.700000,1.70,1.700000

In [13]:
users = purchase_df.groupby("SN")
users_df = users.sum()
big_spenders_df = users_df.sort_values("Price", ascending  = False)

In [108]:
# big_spenders_df
avg = users.mean()
avg = avg.loc[top_spenders_df.index]
avg

             Purchase ID   Age  Item ID     Price
SN
Lisosia93     326.000000  25.0    88.40  3.792000
Idastidru52   499.750000  24.0   131.75  3.862500
Chamjask73    435.333333  22.0   113.00  4.610000
Iral74        571.250000  21.0   129.50  3.405000
Iskadarya95   237.666667  20.0   107.00  4.366667

In [15]:
top_spenders_df = big_spenders_df.iloc[0:5]

top_spenders_df

             Purchase ID  Age  Item ID  Price
SN
Lisosia93           1630  125      442  18.96
Idastidru52         1999   96      527  15.45
Chamjask73          1306   66      339  13.83
Iral74              2285   84      518  13.62
Iskadarya95          713   60      321  13.10

In [104]:
top_spenders2 = users.count()
top_spenders2 = top_spenders2.loc[top_spenders_df.index]
top_spenders2["Total Purchase Value"] = top_spenders_df["Price"]
top_spenders2["Purchase Count"] = top_spenders2["Price"]
top_spenders2["Average Purchase Price"] = top_spenders2["Total Purchase Value"] / top_spenders2["Purchase Count"]
top_spenders2 = top_spenders2[["Purchase Count", "Average Purchase Price", "Total Purchase Value"]]

In [119]:
sn_counts = users.count()['Price']
sn_sums = users.sum()['Price']
sn_avg = users.mean()['Price']

summary_df = pd.DataFrame({"Purchase Count": sn_counts, "Average Purchase Price": sn_avg, "Total Purchase Value": sn_sums})
# show_df = summary_df.sort_values("Total Purchase Value", ascending = False)
# show_df.head()

               Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76                1                2.280000                  2.28
Adastirin33                 1                4.480000                  4.48
Aeda94                      1                4.910000                  4.91
Aela59                      1                4.320000                  4.32
Aelaria33                   1                1.790000                  1.79
...                       ...                     ...                   ...
Yathecal82                  3                2.073333                  6.22
Yathedeu43                  2                3.010000                  6.02
Yoishirrala98               1                4.580000                  4.58
Zhisrisu83                  2                3.945000                  7.89
Zontibe81                   3                2.676667                  8.03

[576 rows x 3 columns]

In [105]:
top_spenders2

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [184]:
top_spenders_df.index

Index(['Lisosia93', 'Idastidru52', 'Chamjask73', 'Iral74', 'Iskadarya95'], dtype='object', name='SN')

In [147]:
items = purchase_df.groupby("Item Name")
itemcounts = items.count()
popularitems = itemcounts.sort_values('Purchase ID', ascending = False).iloc[0:5]
itemsums = items.sum().loc[popularitems.index]
popularitems

,Purchase ID,SN,Age,Gender,Item ID,Price
Item Name,,,,,,
Final Critic,13,13,13,13,13,13
"Oathbreaker, Last Hope of the Breaking Storm",12,12,12,12,12,12
Persuasion,9,9,9,9,9,9
Nirvana,9,9,9,9,9,9
"Extraction, Quickblade Of Trembling Hands",9,9,9,9,9,9

In [148]:
Itemdisplay = popularitems
Itemdisplay["Item ID"] = itemsums['Item ID'] / popularitems['Price']
Itemdisplay["Item Price"] = itemsums['Price'] / popularitems['Price']
Itemdisplay['Total Purchase Value'] = itemsums['Price']
Itemdisplay['Purchase Count'] = popularitems['Purchase ID']
Itemdisplay[['Item ID', 'Item Price', 'Purchase Count', 'Total Purchase Value']]

,Item ID,Item Price,Purchase Count,Total Purchase Value
Item Name,,,,
Final Critic,92.0,4.614615,13,59.99
"Oathbreaker, Last Hope of the Breaking Storm",178.0,4.230000,12,50.76
Persuasion,132.0,3.221111,9,28.99
Nirvana,82.0,4.900000,9,44.10
"Extraction, Quickblade Of Trembling Hands",108.0,3.530000,9,31.77

In [54]:
itemsums

                                              Purchase ID  Age  Item ID  Price
Item Name
Final Critic                                         6371  266     1196  59.99
Oathbreaker, Last Hope of the Breaking Storm         4960  287     2136  50.76
Persuasion                                           3960  217     1188  28.99
Nirvana                                              2761  215      738  44.10
Extraction, Quickblade Of Trembling Hands            3484  223      972  31.77

In [74]:
new = purchase_df[purchase_df["Item Name"]== 'Final Critic']

In [75]:
new

     Purchase ID            SN  Age  Gender  Item ID     Item Name  Price
2              2    Ithergue48   24    Male       92  Final Critic   4.88
99            99  Haisrisuir60   23    Male       92  Final Critic   4.19
252          252      Tyaelo67   39    Male       92  Final Critic   4.88
273          273      Phyali88   15  Female       92  Final Critic   4.88
277          277    Ennalmol65   24    Male       92  Final Critic   4.88
411          411      Lisico81   10    Male       92  Final Critic   4.19
536          536   Siallylis44   20    Male       92  Final Critic   4.19
712          712     Lisilsa62   25    Male       92  Final Critic   4.88
722          722      Ilarin91   22    Male       92  Final Critic   4.88
767          767       Ilmol66    8  Female       92  Final Critic   4.88
768          768  Assassasta79   38    Male       92  Final Critic   4.88
774          774    Jiskjask80   11    Male       92  Final Critic   4.19
778          778       Sisur91    7    Male       92  Final Critic   4.19

In [138]:
#MOST PROFITABLE ITEMS
item_sums = items.sum()
item_counts = items.count()

In [139]:
most_profit = item_sums.sort_values("Price", ascending = False).iloc[0:5]
most_profit

                                              Purchase ID  Age  Item ID  Price
Item Name
Final Critic                                         6371  266     1196  59.99
Oathbreaker, Last Hope of the Breaking Storm         4960  287     2136  50.76
Nirvana                                              2761  215      738  44.10
Fiery Glass Crusader                                 4345  187     1305  41.22
Singed Scalpel                                       3947  178      824  34.80

In [144]:
profit_item_counts = item_counts.loc[most_profit.index]
profit_item_counts

,Purchase ID,SN,Age,Gender,Item ID,Price
Item Name,,,,,,
Final Critic,13,13,13,13,13,13
"Oathbreaker, Last Hope of the Breaking Storm",12,12,12,12,12,12
Nirvana,9,9,9,9,9,9
Fiery Glass Crusader,9,9,9,9,9,9
Singed Scalpel,8,8,8,8,8,8

In [145]:
profit_items = pd.DataFrame({'Item ID': most_profit['Item ID'] / item_counts['Item ID'],
                             'Item Price': most_profit['Price'] / item_counts['Price'],
                            'Purchase Count': item_counts['Purchase ID'], 
                            'Total Purchase Value': most_profit['Price']})

In [146]:
profit_items

,Item ID,Item Price,Purchase Count,Total Purchase Value
Item Name,,,,
Final Critic,92.0,4.614615,13,59.99
"Oathbreaker, Last Hope of the Breaking Storm",178.0,4.230000,12,50.76
Nirvana,82.0,4.900000,9,44.10
Fiery Glass Crusader,145.0,4.580000,9,41.22
Singed Scalpel,103.0,4.350000,8,34.80